[{"description-section": " Responsibilities   Provide HR support and consultation to our Googler and Manager clients, answering employee and manager questions about HR programs, policies, and other HR-related items. Advise on performance management issues and lead minor investigations and reorganizations. Assist People Partners with planning and roll-out of HR programs and initiatives. Triage Googler enquiries via our internal systems and connect Googlers to the right subject-matter expert when necessary. Identify opportunities to improve HR policies by gaining insights across multiple experiences of Googlers/Managers. Identify and propose solutions to correct inconsistent HR policies and gaps.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 5 years of HR Business Partner or generalist experience. Preferred qualifications: MBA or Master's degree. Demonstrated experience with cross-functional collaboration and influencing stakeholders. Client-service experience with a strong focus on delivering exceptional customer service. Effective interpersonal, teamwork and organizational skills. ", "description-section text with-benefits": "People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You'll be a champion of Google's culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data. Whether coaching your clients on how to lead their teams, navigating and resolving employee relations issues or managing programs that help develop our Googlers, you are exceptionally focused on putting them first, and being as clear and transparent as possible to help Googlers understand how people decisions get made. In this role, you will deliver solutions to HR Business Partners (HRBPs) and clients seamlessly. You will be responsible for coaching clients, navigating and resolving employee relations issues, and managing programs that help to develop our Googlers. You will use your communication, organization and collaboration skills on a global scale with a wide variety of stakeholders. You will also work closely with the HRBPs and liaise with other functions (e.g. communications, etc) and stakeholders across Google.Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the champions of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\" - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "title": "People Consultant", "company": " Google ", "description-section text": "", "location": "Gurugram, India"}, {"description-section": " Responsibilities   Drive value proposition and strategy across proprietary and third-party Reach/GRP measurement solutions, leveraging them to articulate the value of Google. Work with internal solutions, i.e Brand Lift, unique reach, GRPs, TRPs, and external solutions with 3P, i.e Sales lift, Viewability, MMM. Lead Brand measurement solutions including working with Large Customer Sales team (LCS), Public Relations team, executives, and other product management team members. Lead these conversations as a referent. Influence go-to-market teams to shape Spanish speaking countries in Latin America (SPLA) objectives and key results (OKRs) and activation plans for our sales teams in order to help our customers make Google a core part of their marketing plans based on measurement solutions to prove Google's contribution to brand Key Performance Indicators (KPIs).   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 5 years of experience in digital advertising sales, product marketing or product management. 3 years of experience in market research and measurement, and project management experience. Experience in digital branding and Google’s measurement products and consultative sales. Client-facing experience. Preferred qualifications: MBA degree. Agency/Brand advertiser experience or experience servicing agencies. Working knowledge of brand advertiser needs, KPIs and digital marketing plans. Organized self-starter with ability to manage multiple projects from inception to completion. Demonstrated ability to manage highly strategic and difficult business problems. Ability to create influential relationships and work in a cross-functional, team matrixed environment. Oral and written communications skills across internal and external stakeholders. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. Together with the Americas team, you´ll be responsible for all YouTube solutions that aim to have a platform that is suitable for our advertisers and aligned with their brand values. The Brand Measurement vision is to partner with industry leading third-party measurement companies and build proprietary solutions that assess brand impact of advertising in Google products. This role is focused on third-party (i.e Viewabilty, Sales Lift, Media Mix Modeling (MMM)), as well as Google-owned solutions to measure post-campaign Brand Lift Survey, Reach, Frequency, GRP and TRP metrics.  You are a strong specialist with deep knowledge of brand advertiser marketing objectives and possess the ability to bridge cross-functional teams, and drive our products’ value proposition. You will work to drive business growth through the identification of relevant opportunities, finding creative solutions that support our clients in measuring the success of their advertising campaigns. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "title": "Brand Measurement and Safety Specialist, PSS SPLatAm", "company": " Google ", "description-section text": "", "location": "Mexico City, Mexico"}, {"description-section": " Responsibilities   Specific responsibilities vary by project area.   Qualifications  Minimum qualifications: Currently enrolled in a 4 year Bachelor's degree program, majoring, or intending to major, in Computer Science or a closely related field at a university in the same country/region of the session to which you are applying. Must be in your second year of education. Preferred qualifications: Programming experience in either Java, Python, C, or C++. ", "description-section text with-benefits": "Google aspires to be an organization that reflects the globally diverse audience that our search engine and tools serve. We believe that, in addition to hiring the best talent, a diversity of perspectives, ideas and cultures leads to the creation of better products and services.  Google is invested in increasing the pipeline of future computer scientists and software developers, particularly those who are historically underrepresented in the field. Many aspiring computer scientists could benefit from a program that bridges the gap between academic study and a professional internship. We want to inspire these students to continue in the field with this program.  With this in mind, Google is pleased to announce that the 2018 Engineering Practicum internship program will now be open to university students currently in their second year, majoring, or intending to major in, Computer Science or a related subject. This program includes three main components: a software project, skills-based training and professional development.  This internship program includes: Software Project: A three-month development project that you will work on with a team of Googlers and other Engineering Practicum interns. Skills-Based Training: Enhance your coding skills, and gain exposure to new tools and programming languages. Professional Development: Attend ongoing technical talks by senior Googlers. Additionally, learn how to enhance your resume, tackle technical interviews, and improve your presentation skills. Mentorship: Be matched with a Google engineer, other than your manager, who will guide you through your summer experience. Fun: Participate in social activities, community building and networking. Build relationships with your peers. Exposure: Gain a unique glimpse into applying your computer science studies in a professional environment.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to tackle some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.", "title": "Engineering Practicum Intern 2018", "company": " Google ", "description-section text": "For immediate consideration, please send a text (ASCII), HTML, PDF or DOC version of your resume in English to jobs@google.com. Important: The subject field of your email must include Engineering Practicum Intern 2018 - Beijing or Shanghai. Our team will review applications on a rolling basis and it's in the candidate's best interests to apply early. All hiring will be completed by the end of May 2018. This internship will run from between July 2018 to October 2018, for a consecutive 14 weeks. Thank you for your patience while we consider your application.Note: By applying to this position your application is automatically submitted to the following locations: Beijing, China; Shanghai, China", "location": "Beijing, China"}, {"description-section": " Responsibilities   Specific responsibilities vary by project area.   Qualifications  Minimum qualifications: Currently enrolled in a 4 year Bachelor's degree program, majoring, or intending to major, in Computer Science or a closely related field at a university in the same country/region of the session to which you are applying. Must be in your second year of education. Preferred qualifications: Programming experience in either Java, Python, C, or C++. ", "description-section text with-benefits": "Nest Cam’s Integration Engineering team is looking for strong test engineers to lead all aspects of new product and feature qualification from concept to post-release monitoring to ensure we quickly ship features that delight customers. Engineers in the role will have the opportunity to gain a breadth of understanding about what makes Nest’s camera products tick. Specifically you will be responsible for testing the embedded systems that rely on sensors, machine learning and cloud connectivity. The ideal candidate has a strong background in low-level and system/test development for embedded devices and has worked on or tested camera firmware.  The work:  Review new features at design and implementation time for compatibility with existing features, feasibility of implementation, testability, test coverage and monitorability  Develop and drive sustainable test plans that account for new and legacy products  Automate tests for an embedded software system to cover new and existing features, focusing on hermetic, stable, and fast tests that maximize code and feature coverage and factor in user behavior, environmental variation, and manufacturing tolerances  Identify key product indicators to monitor once software has been shipped to customers  Drive requirements with adjacent engineering teams for tools that automatically gather and expose key product indicators for new features  Root-cause test failures and indicator changes, identifying responsible teams and driving quick resolution of product, infrastructure, and environment issues  Maintain database of test cases both existing and future with thoroughness and consistency  Minimum qualifications:  A bachelor’s degree in Computer Science, Computer Engineering, or equivalent practical experience  3+ year’s experience with software application testing and test automation  3+ year’s experience with UNIX, Linux, or OS X  3+ year’s experience with Python, Ruby, or Perl  3+ year’s experience with C or C++  Strong test plan and test case writing skills  Preferred qualifications:  A master’s degree in Computer Science, Computer Engineering, Software Engineering, or equivalent practical experience  3+ year’s of experience with pdb or similar debugging tools  3+ year’s of experience testing clients of RESTful web services  5+ year’s of experience with software application testing and test automation  5+ year’s of experience with UNIX, Linux, or OS X  5+ year’s of experience with Python  Demonstrate good coding style and practices  Understanding of sensor technologies, filtering/sensing algorithms, and validation techniques  Strong ability to multi-task and prioritize  Strong time management skills  Detail oriented and able to work independently  Strong organizational skills *LI-DNI", "title": "Test Engineer, Embedded Software - Nest Camera", "company": " Nest ", "description-section text": "For immediate consideration, please send a text (ASCII), HTML, PDF or DOC version of your resume in English to jobs@google.com. Important: The subject field of your email must include Engineering Practicum Intern 2018 - Beijing or Shanghai. Our team will review applications on a rolling basis and it's in the candidate's best interests to apply early. All hiring will be completed by the end of May 2018. This internship will run from between July 2018 to October 2018, for a consecutive 14 weeks. Thank you for your patience while we consider your application.Note: By applying to this position your application is automatically submitted to the following locations: Beijing, China; Shanghai, China", "location": "Palo Alto, CA, United States"}, {"description-section": " Responsibilities   Design, code and test internal tools to create an excellent customer support experience for our users. Identify and implement technical solutions to efficiently scale our support model. Build relationships with internal and external partners to better understand and support use of our tools. Analyze and monitor key metrics to drive request prioritization and issue resolution.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Experience with Python and/or Go, JavaScript and HTML. Experience with web application development. Preferred qualifications: Practical Machine Learning experience. Experience in building customer service infrastructure. Knowledge of building efficient user interfaces with JavaScript frameworks. Strong algorithmic and data structure knowledge with practical applications. A passion for providing excellent customer support. Strong communication skills and ability to work independently. ", "description-section text with-benefits": "With the Google Access team, you’ll work on cross-product and cross-team initiatives, working closely with cross-functional team members to refine and evolve our projects, as well as deploy new technologies to markets and communities around the globe. You like being on-the-ground, executing complex projects that bring internet access to people. Google Fiber is an exciting new business for Google aiming to deploy next generation, gigabit Internet speed to the home. As a Customer Service Tools Developer, you will design and build the necessary tools and solutions to enable our team to effectively support our customers. You will be an expert in our products and services, and you will provide both specific and broad solutions for our customers. You will work directly with cross-functional teams such as Engineering and Product to gather requirements to improve and innovate our service delivery. At Access, our mission is to create abundant internet on networks that are always fast and always open. Google Fiber provides superfast Internet to homes in 9 metro areas across the U.S. We want to bring Google Fiber to customers even faster, so we’re focused on making deployment more efficient and less intrusive.", "title": "Tools Specialist, Google Fiber", "company": " Google Fiber ", "description-section text": "For immediate consideration, please send a text (ASCII), HTML, PDF or DOC version of your resume in English to jobs@google.com. Important: The subject field of your email must include Engineering Practicum Intern 2018 - Beijing or Shanghai. Our team will review applications on a rolling basis and it's in the candidate's best interests to apply early. All hiring will be completed by the end of May 2018. This internship will run from between July 2018 to October 2018, for a consecutive 14 weeks. Thank you for your patience while we consider your application.Note: By applying to this position your application is automatically submitted to the following locations: Beijing, China; Shanghai, China", "location": "Mountain View, CA, United States"}, {"description-section": " Responsibilities   Consult with team Leaders to create a comprehensive people plan in order to influence lasting change over large functions at Google; act as a trusted advisor and coach to leadership, and play a critical role in enhancing their effectiveness. Manage people-related initiatives with your communication, coaching and influencing skills, and offer thought-leadership regarding organizational/people-related strategy and execution; provide insightful data to guide decision making and provide proactive solutions. Ensure that the organization is structured in a way that helps achieve business objectives; manage talent effectively to ensure we have the right people in the right roles while enabling leaders to cultivate an effective leadership pipeline. Set the strategy for People Operations programs; educate clients on various HR initiatives including learning and development, recognition programs, reorganizations and various management issues. Partner closely with functional People Partners and People Operations colleagues to deliver services to client groups; address and manage a broad spectrum of employee relations matters, and work to resolve them through a systematic approach, adhering to company policies, local employment laws and best practices.   Qualifications  Minimum qualifications: Bachelor's degree or equivalent practical experience. Experience working as a Human Resources Business Partner (HRBP) or generalist and/or experience in relevant Human Resources disciplines. Experience in an Operational or and Project Management role (e.g., managing site wide/organizational projects and initiatives). Preferred qualifications: Master of Business Administration or Master's degree. Experience in Management Consultation, working with external clients. A combination of HR experience in the following areas: organizational design, succession planning, performance management, diversity and inclusion, business consulting, coaching and development, talent management, data analysis and employee relations. Demonstrated analytical and problem solving skills, with the ability to analyze data, understand trends and develop recommendations for action based on the analysis. Effective consultation and coaching skills, with the ability to build relationships with leaders, and a complex set of stakeholders, in order to drive organizational change. ", "description-section text with-benefits": "People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You'll be a champion of Google's culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data. Whether coaching your clients on how to lead their teams, navigating and resolving employee relations issues or managing programs that help develop our Googlers, you are exceptionally focused on putting them first, and being as clear and transparent as possible to help Googlers understand how people decisions get made. As a People Partner (formerly known as Human Resources Business Partner), you will be responsible for overcoming organizational challenges through people-related solutions. You will create the end-to-end people strategy that will support Googlers in realizing their ambitions. You will partner with a cross-functional group of subject matter experts to design and execute strategies for how we staff, onboard, develop, motivate, retain and organize work.  As part of our culture, you will also have the opportunity to be hands on and work side-by-side with Googlers to complete operations on a variety of people-related areas. As a core part of this hands on work, you will be rolling out programs to support Googlers, including compensation, performance and talent programs. Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the champions of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\" - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "title": "People Partner, Google Marketing Solutions", "company": " Google ", "description-section text": "For immediate consideration, please send a text (ASCII), HTML, PDF or DOC version of your resume in English to jobs@google.com. Important: The subject field of your email must include Engineering Practicum Intern 2018 - Beijing or Shanghai. Our team will review applications on a rolling basis and it's in the candidate's best interests to apply early. All hiring will be completed by the end of May 2018. This internship will run from between July 2018 to October 2018, for a consecutive 14 weeks. Thank you for your patience while we consider your application.Note: By applying to this position your application is automatically submitted to the following locations: Beijing, China; Shanghai, China", "location": "Dublin, Ireland"}, {"description-section": " Responsibilities   Identify opportunities for staffers to build their understanding of diversity, equity, and inclusion. Partner with PeopleDev, LearningNav, and EDII to design a development journey, through the lens of diversity, equity, and inclusion, for the full staffer lifecycle. This includes both standalone trainings and integration of diversity, equity, inclusion mindsets, language and principles into all existing and new staffer trainings. Partner with EDII and the Hiring Innovation team to ensure the diversity, equity, and inclusion related content in staffing trainings is aligned with interviewer training to promote common language and mindsets. Ensure the resources designed to support staffer development (FAQ docs, candidate talking points, etc.) stay relevant and are well socialized.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 2 years of experience in learning and development. 1 year of experience in the diversity, equity or inclusion space or with related projects. Preferred qualifications: Experience building a training roadmap, specifically in the diversity and inclusion space. Ability to work in a fast-paced, constantly evolving environment. Ability to influence across multiple teams. Demonstrated high attention to detail and strong operational expertise. ", "description-section text with-benefits": "Google's known for our innovative technologies, products and services -- and for the people behind them. Whether you are making our staffing systems more efficient, planning for our growth, building relationships on college campuses or cultivating the next generation of computer scientists, you have an eye on the staffing needs of Google and the broader hiring landscape. You are focused on cultivating outstanding candidates for Google's long-term hiring needs, and you are the glue that ties together a cross-functional and international group of staffing teams. You are both scrappy and resourceful, creative and driven -- and excited to share the magic of working at Google. As a Staffing Content Specialist focused on diversity, equity and inclusion, you will leverage your knowledge of learning and development best practices and exceptional execution skills to ensure our staffing organization is equipped to build a truly diverse and inclusive Google. In this specialist role, you will partner with members of the Staffing organization, PeopleDev (our Learning and Development organization), and EDII (Equity, Diversity, Inclusion, and Integrity team) to ensure that staffers have access to the relevant trainings and resources, and are developing their own expertise to become practitioners of inclusive sourcing and hiring practices. Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the champions of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\" - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "title": "Staffing Content Specialist, Diversity and Inclusion", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Mountain View, CA, United States"}, {"description-section": " Responsibilities   Correspond with agencies and clients regarding high-priority activities. Showcase clients' business value and encourage future growth of our partnerships. Inform and educate clients about the latest brand products, betas and insights to keep them up to date on opportunities across our solutions. Balance urgent work with important clients. Deliver service excellence and KPI fulfillment for complex, continuously flighted activity.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Experience working in the UK/I Market Experience in consultative sales and account management. Ability to speak and write in English fluently and idiomatically. Preferred qualifications: Experience in strategic and tactical digital advertising. Experience with managing performance/direct response advertisers. Experience in senior level client relationship development and multi-market digital planning and execution management. Detail-oriented with the ability to efficiently troubleshoot and manage complex implementations. Interest in developing customer partnerships. Effective presentation, influencing and communication skills. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grows. You leverage your entrepreneurial drive to target, educate and persuade new customers to embrace Google's latest advertising products and technologies. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, understand the details of individual campaigns and persistently explore and uncover the business needs of key clients. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. In this role, you'll partner with some of the UK’s largest advertisers covering a wide range of industries.Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "title": "Account Manager, Large Customer Sales", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Dublin, Ireland"}, {"description-section": " Responsibilities   Set global strategy for OEM and carrier co-marketing programs to drive awareness, preference and usage of Google Assistant. Implement and optimize OEM and carrier co-marketing programs in collaboration with the Platforms and Ecosystems team. Develop global retail strategy to showcase the Google Assistant experience and device ecosystem. Partner with Sales and Product Management teams to design and launch new retail and OEM incentive programs and promotions. Manage a team of Product Marketers.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 6 years of product marketing experience in the technology space.  Preferred qualifications: MBA degree. Experience in partner marketing and retail strategy. Experience delivering large-scale projects and managing multiple complex projects simultaneously. Demonstrated ability to analyze and distill data into actionable insights and impactful Go-to-Market plans. Ability to influence at all levels and work effectively across functions and geographies. ", "description-section text with-benefits": "Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (AdWords, AdSense, DoubleClick, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end. Google Assistant aims to make it radically simpler for people to find information and get things done throughout their day on a wide variety of devices made by many different manufacturers, in addition to Google’s own devices. As a Co-Marketing and Retail Lead, you'll help make third-party device manufacturers successful through Google Assistant, and drive engaged users of Google Assistant.  Specifically, as a Co-Marketing and Retail Lead, you'll set global strategy for partner marketing opportunities with device Original Equipment Manufacturers and mobile carriers, and drive retail experiences that bring the Google Assistant ecosystem to life, including Google’s devices, third-party devices, and smart home devices with Google Assistant integration. Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.", "title": "OEM Retail Marketing Lead, Google Assistant", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Mountain View, CA, United States"}, {"description-section": " Responsibilities   Set global strategy for OEM and carrier co-marketing programs to drive awareness, preference and usage of Google Assistant. Implement and optimize OEM and carrier co-marketing programs in collaboration with the Platforms and Ecosystems team. Develop global retail strategy to showcase the Google Assistant experience and device ecosystem. Partner with Sales and Product Management teams to design and launch new retail and OEM incentive programs and promotions. Manage a team of Product Marketers.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 6 years of product marketing experience in the technology space.  Preferred qualifications: MBA degree. Experience in partner marketing and retail strategy. Experience delivering large-scale projects and managing multiple complex projects simultaneously. Demonstrated ability to analyze and distill data into actionable insights and impactful Go-to-Market plans. Ability to influence at all levels and work effectively across functions and geographies. ", "description-section text with-benefits": " Millions of Nest customers touch our apps daily to make their homes and their families safer, more comfortable, and more energy efficient. Every member of our team has an opportunity to make a big impact knowing that the apps they develop will receive lots of visibility, both internally and externally. The work:Work with a small team of top-tier developers who are designing great user experiences and building truly great applications for Android devicesParticipate in scrums consisting of cross functional teams, both software and hardwareEnsure that features are being delivered efficiently and on-timeIn addition to code contribution, you will also participate in architectural review and designCollaborate with our world-class design team to help deliver the fantastic user experiences that our users expect from NestMinimum qualifications: 2+ years work experience as a software engineer, or relevant experience Preferred qualifications: Deep understanding of Android application development in Java  Proven track record of shipping software and successfully \u2028released apps on Google Play (please include names and links on your resume)  Experience with best in class software engineering practices (e.g. unit testing, code reviews, design documentation)  Strong attention to detail on every line of code, every unit test, and every commit message  We love when engineers send us a link to their GitHub and/or Stack Overflow accounts, technical blog, or links to apps they've shipped ", "title": "Android Applications Engineer", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Boulder, CO, United States"}, {"description-section": " Responsibilities   Write and edit dialogue in relation to user interaction and character development.   Qualifications  Minimum qualifications: Bachelor's degree in Creative Writing or equivalent practical experience. 5 years of experience as a writer for consumers. Experience writing dialogue for plays/screenplays, fiction/interactive fiction, and/or comedy/entertainment. Ability to speak and write fluently and idiomatically in Japanese.  Preferred qualifications: Experience and interest in product and game design and artificial intelligence. Passion for pop-culture and current news. ", "description-section text with-benefits": "The Google Doodle team is all fun and games. We are on a mission to find the right person to join our talented team of characters who are creating some fun for the Google Assistant. You have previously written for a character for film, TV, video game, or comic book and can deliver a joke that can make anyone smile or you're the person at the party who wins the trivia contest because you can finish the fun film quote or recite obscure music lyrics.  The Google Assistant Personality team is dedicated to bringing a bit of fun and a human touch to people interacting with the Google Assistant through chat, phones, TVs, watches, Google Home and other devices we haven’t even thought of yet. As a Creative Writer, you will work closely with international Creative Leads in adapting the Google Assistant persona for your region. You will be writing dialogue and curating a wide range of content including jokes, quotes, fun facts and games making sure it all feels natural for the market.  Success will be measured both in terms of quantity (delivering a high volume of content) and quality (delivering culturally appropriate compelling content). There is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. We're constantly refining our signature search engine to provide better results, and developing offerings like Google Instant, Google Voice Search and Google Image Search to make it faster and more engaging. We're providing users around the world with great search results every day, but at Google, great just isn't good enough. We're just getting started.", "title": "Creative Writer, Doodle Team, Google Assistant (Japanese)", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Mountain View, CA, United States"}, {"description-section": " Responsibilities   Write and edit dialogue in relation to user interaction and character development.   Qualifications  Minimum qualifications: Bachelor's degree in Creative Writing or equivalent practical experience. 5 years of experience as a writer for consumers. Experience writing dialogue for plays/screenplays, fiction/interactive fiction, and/or comedy/entertainment. Ability to speak and write fluently and idiomatically in Japanese.  Preferred qualifications: Experience and interest in product and game design and artificial intelligence. Passion for pop-culture and current news. ", "description-section text with-benefits": "With hundreds of thousands of Nest customers touching our apps daily to make their homes and their families safer, more comfortable, and more energy efficient, every member of our team has an opportunity to make a BIG impact and know that the apps they develop will receive lots of visibility, both internally and externally. The work:  Work with a small team of top-tier developers who are designing great user experiences and building truly great applications for Android devices  Participate in scrums consisting of cross functional teams, both software and hardware  Ensure that features are being delivered efficiently and on-time  In addition to code contribution, you will also participate in architectural review and design  Collaborate with our world-class design team to help deliver the fantastic user experiences that our users expect from Nest  Minimum qualifications:  5+ years work experience as a software engineer or relevant experience  3+ yrs of experience in developing native Android Applications  Preferred qualifications:  Deep understanding of Java/Android application development  Proven track record of shipping software and successfully \u2028released apps on Google Play (please include names and links on your resume)  Strong attention to detail on every line of code, every unit test, and every commit message  Comfortable with rapid development cycles and tight schedules  We love when engineers send us a link to their Github and/or StackOverflow accounts, technical blog, or links to apps they've shipped ", "title": "Android Applications Engineer", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Palo Alto, CA, United States"}, {"description-section": " Responsibilities   Deliver seamless, high touch mobility support to external hires and relocating Googlers to ensure a smooth Onboarding at Google. This includes case work, exception and escalation management. Show ownership and problem solve for issues impacting our end users and cross-functional teams. Partner with Google’s Mobility vendor network and key stakeholders to ensure operational efficiency and timely delivery of services. Use analytical and quantitative methods to understand, predict and advance processes and their integration with various GPS Ops functions in an automated and compliant manner. Define, collect and analyse user feedback and process metrics. Use insights gathered to scale existing processes for growing and/or changing user needs. Create and maintain process documentation for all your processes, training colleagues where required.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience 3 years of relevant work experience Experience in customer/user service delivery in large scale environments Preferred qualifications: Experience driving user-focused improvements, navigating/influencing cross-functional teams to drive change and analysing data/trends. Prior experience in Mobility and demonstrated program and vendor management skills. Ability to establish and maintain effective relationships and partnerships with key stakeholders Ability to self-start and self-direct work in an ambiguous environment. High level of creativity, perseverance and openness to change. Strong interpersonal, teamwork and organizational skills ; demonstrated attention to detail with time-management and multitasking skills. Superior verbal and written communication skills, with an emphasis on tact and diplomacy ", "description-section text with-benefits": "The Google People Services, Operations function is the services and program management group within People Operations that makes HR stuff easy and intuitive for Googlers. Our global team optimizes people processes, from problem definition to execution. We partner with teams across People Operations and in engineering to bring innovation and technology to the way we attract, retain and grow Googlers worldwide. We focus on providing an amazing experience to past, present and future Googlers, and work in Google’s fast-paced environment to deliver 100+ operational services, manage the contingent workforce and implement HR programs across 70+ countries. Regardless of location or level of experience, members of the Operations team have the opportunity to create, develop and implement some of the most complex global operations around the world. The Google People Services, Operations (GPS Ops) function is a services and program management group, that makes HR easy and intuitive for Googlers. Our focus is on creating magical HR experiences for past, present and future Googlers working in Google’s fast-paced environment and overseeing the end-to-end global delivery of 100+ operational HR services, contingent workforce and HR programs (from problem definition, solution design through to execution). We partner with teams across Google HR (People Operations), engineering and external partners to bring innovation and technology to the way we attract, retain and grow Googlers worldwide.  The Global Mobility team plays a role of a key partner for the talent supply chain and hiring at Google. In this role, you will work closely with our Program Managers and Vendor partners, to ensure regional (and global) delivery of our Mobility program. You will be part of a fast-paced, user-focused and global mobility team that leverages company philosophy, technology and your industry expertise to ensure a superb experience for Candidates and Googlers and our partners.Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the champions of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\" - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "title": "Google People Services, Global Mobility Specialist", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Singapore"}, {"description-section": " Responsibilities   Work closely with our Sales team. Identify, develop, and optimize new business opportunities and develop client relationships by leveraging Google products and technologies. Help partners in their day-to-day challenges by delivering innovative and scalable solutions and troubleshooting their technical issues. Develop cutting-edge solutions as the technical lead, provide consulting services to our partners, build lasting relationships and be sensitive to client needs. Propose, design, create and present prototypes, demos and proofs-of-concept to a wide variety of audiences, from engineers to marketing professionals. Perform implementation reviews. Advocate for new product features, and provide partner feedback to internal cross-functional teams including Product Management and Engineering. Travel as required to meet with specific partners/clients across the world.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or a related technical subject, or equivalent practical experience. Experience with web technologies such as HTML, CSS, JavaScript, and HTTP. Experience in one or more programming languages, including Java, C++, Python. Experience working with and managing external partners/customers and ability to speak and write in English and Russian fluently and idiomatically. Preferred qualifications: Familiarity with SQL/MySQL and Unix/Linux operating systems/commands. Demonstrated ability to adapt your message to the technical level of the audience and comfort presenting technical materials to groups of any size and background. Excellent project management skills and attention to detail. Excellent problem solving, analytical and troubleshooting skills. Ability to speak and write in one or more of the following languages fluently and idiomatically: French, Russian, Polish, Turkish. ", "description-section text with-benefits": "Google Technical Services: Professional Services (gPS) is a team of solution-oriented trusted advisors supporting millions of users worldwide. Our consultative services take our deep technical and product expertise and combine it with our powerful understanding of our customer’s needs and goals to solve their biggest business challenges allowing them to grow and get the most out of Google solutions. Google Technical Services is a global support and operations team, with a mission to delight our customers with care so good, it’s got to be Google. Our team is the face of Google to most of our customers, and we want their Google support experience to set new standards, just like Google’s products do. Our team cares for customers by solving problems and scaling solutions, incubating new Google products, and sharing user feedback with internal teams to influence product development. We support a wide variety of products, from Ads to Project Fi and just about everything in between, and our customers include advertisers, consumers, partners, publishers, retailers, and our own Sales Googlers.", "title": "Technical Solutions Consultant (Russian), Google Technical Services", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "London, United Kingdom"}, {"description-section": " Responsibilities   Support client groups with recruiting processes including scheduling interviews, organizing candidate travel arrangements, hosting candidates on campus, reserving conference rooms and liaising with candidates and leaders at Google and their administrative partners. Create and distribute employment-related correspondence. Communicate professionally, arrange special requests and provide a high-touch experience appropriate to the candidate’s needs. Improve processes using a data-driven approach including optimization of interviewer loads, identification of trends and challenges in scheduling process, and execution of initiatives to increase efficiency and improve experience.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Experience in a staffing, human resources and/or consultation role. Experience in project management, working with business analytics, scripting tools and databases.  Preferred qualifications: Experience in administration; managing bookings, diaries, data, etc. Experience in identifying and improving issues in processes, and suggesting user-focused improvements. Ability to prioritize multiple functions and tasks, and manage time efficiently, with the ability to interact comfortably with candidates and clients. Self-directed, detail-oriented problem solver with a desire to contribute to the organization's reputation and success. Demonstrated drive, with the ability to take initiative and build productive relationships. Excellent attention to detail, with the ability to contribute in a fast-paced, dynamic work environment. Excellent interpersonal and communication skills, with a high level of creativity, perseverance, and openness to change. ", "description-section text with-benefits": "Google is known for our innovative technologies, products and services — and for the people behind them. The Google People Services (GPS) team focuses on providing an amazing experience to past, present and future Googlers. As a Programs Coordinator, you will enthusiastically represent the Google brand and build our talent pipeline. Whether it’s making our staffing systems more efficient, planning for our growth, building relationships on college campuses or cultivating the next generation of computer scientists, you will have an eye on the staffing needs of Google and the broader hiring landscape. You'll be focused on cultivating outstanding candidates for Google's long-term hiring needs, and you are the glue that ties together a cross-functional and international group of staffing teams. As a Staffing Services Associate, you'll ensure a seamless, candidate-friendly hiring process, and help keep processes organized and efficient while actively maintaining clear lines of communication with Recruiters, Hiring Managers and candidates - from entry-level to leadership hires. By providing great customer service, and smoothly managing all the details, you'll contribute to the overall success of the Staffing team.Great just isn't good enough for our People Operations team (you probably know us better as \"Human Resources\"). Made up of equal parts HR professionals, former consultants and analysts, we're the champions of Google's colorful culture. In People Ops, we \"find them, grow them, and keep them\" - we bring the world's most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.", "title": "Staffing Services Associate", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "London, United Kingdom"}, {"description-section": " Responsibilities   Grow Google’s business and confidence among Agency partners. Define the Agencies’ business strategy, identifying transformational opportunities that allow Google to capture new budgets at scale. Create transformational goals for each Agency, follow up on Agency feedback and adjust the plan accordingly. Translate business plans into quarterly plans, define accurate business growth goals per Agency in collaboration with Account Managers. Analyze data, trends and Agency business performance, develop solid strategic plans, prepare and conduct strategic pitches and consultative sales presentations. Establish and nurture C-level relationships with Agencies, contribute strategically to the growth and direction of Google’s products and services.   Qualifications  Minimum qualifications:  BA/BS degree or equivalent practical experience. 5 years of experience in advertising sales, marketing, consulting or media. Business level communication in Japanese and English. Preferred qualifications: Experience building relationships with Agency executives. Cross-functional understanding of media businesses and operations. Effective business acumen and problem solving skills. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Industry Manager, you will develop plans to identify Agency needs and required sales tools, practices, using your industry knowledge. Also, you will give effective presentations to persuade Agencies in using Google platforms, products, and solutions to boost their business. Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "title": "Industry Manager, Business Development, Agency Partnership Team (English, Japanese)", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Tokyo, Japan"}, {"description-section": " Responsibilities   Correspond with agencies and clients on high priority activity using your stakeholder management capability. Enhance clients' business value and encourage future growth of our partnerships. Improve and educate clients constantly on the latest brand products, betas and insights to keep them up to date on opportunities across our solutions. Use your prioritization and time management skills to balance urgent work with important clients in an often fast paced environment. Use your eye for detail to deliver service excellence and KPI fulfillment for complex, continuously flighted activity.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Experience in consultative sales and account management. Ability to speak and write in English fluently and idiomatically. Preferred qualifications: Experience in senior level client relationship development and multi-market digital planning and execution management. Experience working in the UK/I market. Detail oriented with the ability to efficiently troubleshoot and manage complex implementations. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grows. You leverage your entrepreneurial drive to target, educate and persuade new customers to embrace Google's latest advertising products and technologies. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, understand the details of individual campaigns and persistently explore and uncover the business needs of key clients. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As an Account Manager on the Beauty portfolio, your scope will be wide and the role varied. You will be in the unique position of working to develop brand led client solutions for these mature clients, helping them navigate established brands through new challenges. You will frequently focus on achieving this through Display and YouTube solutions and will get to partner closely with both our Media Buying Solutions and Global Client and Agency Solutions partners.  As an Account Manager, you'll manage relationships with clients, which means you will be a proactive self-starter and have the ability to multi-task in a fast-paced environment and focused to help expand the client relationship. You will be expected to consult and partner with our key clients to help them grow their businesses through the use of all of Google’s solutions across Search, Display and YouTube, to help our customers connect instantly and seamlessly with their audiences and get the most out of the web.Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "title": "Account Manager, Beauty, Large Customer Sales (UKI)", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA", "location": "Dublin, Ireland"}, {"description-section": " Responsibilities   Hire, coach and drive a high performance team to deliver against assigned goals while prioritizing an outstanding customer experience to customers and prospects. Work with the team to create activities (e.g. identifying and handling key customer technical questions and objections) in order to develop strategies, resolve technical impediments and scope out migration workloads. Be responsible for technical aspects of solutions to include such activities as managing product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources. Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and documents. Make recommendations on integration strategies, enterprise architectures, platforms and the application infrastructure required to successfully implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or related technical field or equivalent practical experience. 10 years of experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer facing role (including working as a member of a professional services or systems engineering team). Experience with managing and developing teams. Preferred qualifications: Master's degree in Computer Science or MBA degree. Demonstrated knowledge of solution architecture within web and mobile environment. Knowledge of web/internet related technologies, architecture across SAAS, PAAS and IAAS and cloud productivity suites. Knowledge of Google Cloud products (G Suite, Google Cloud Platform). Proven ability to inspire and grow teams to their full potential in a sales environment across cross-functional teams to achieve common business objectives. Ability to operate with enthusiasm and flexibility in a fast-paced, constantly evolving team environment. Ability to effectively present to both technical and non-technical audiences. Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT technology space. Excellent analytical, project management and organizational skills. ", "description-section text with-benefits": "As a Solution Engineer Manager, you will lead a team of customer engineers who engage with sales prospects and channel partners to understand and assess customer requirements, prepare and present demonstrations of Google’s Cloud technologies, and address and overcome technical objections that arise throughout the sales process. You will also lead efforts to drive solution innovation, working across the organization to identify the assets and tools to drive customer adoption. Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.", "title": "Solution Engineer Manager, Google Cloud", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Gurugram, India"}, {"description-section": " Responsibilities   Work with the Cloud leadership team to deliver a business systems strategy, and oversee successful delivery of annual systems plans; partner with Cloud product teams to ensure the support, fulfillment, and contracting processes are seamless for Cloud customers. Drive seamless day-to-day operations enabling the changes and growth of Go-To-Market teams. Monitor and report on health and opportunities; develop strategic insights and recommendations via assessing market trends and internal performance analysis. Identify, share and scale best systems solutions from across industry and Google.   Qualifications  Minimum qualifications: 20 years of relevant work experience. 5 years of leading multiple Salesforce implementations for multinational corporations. Preferred qualifications: Relevant engineering-based work experience, and/or relevant management consulting experience. People management experience. Experience with cloud business, and sales and marketing organizations. Demonstrated ability to manage multiple projects and work-streams in a fast-paced environment. Ability to engage at all levels of the organization, both internally and externally with excellent verbal communication, analytical and problem solving skills. Effective partnering and collaboration skills, with the ability to drive action in a cross-functional and relationship-based organization. ", "description-section text with-benefits": "Google's projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You're equally at home explaining your team's analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.", "title": "Director, Go-To-Market Systems", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Sunnyvale, CA, United States"}, {"description-section": " Responsibilities   Develop a deep understanding of our strategic products (Mobile, Brand, Conversion Tracking, Shopping) and the scenarios in which they are a good fit for our clients. Know our internal tools and how they can be used in the team, account or campaign level to identify opportunities for our clients. Implement solutions, track performance and optimize against advertiser goals. Report on key performance indicators and value delivered for the team. Create proposals to represent solution design around client goals.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Ability to speak and write in English and Dutch fluently and idiomatically. Preferred qualifications: Client service/account management experience. Experience in data analysis and reporting. Ability to operate independently, and also collaborate as part of a tight-knit team. Ability to work in fast-paced environments with effective time-management skills. Excellent analytical and problem-solving skills. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.The Google Marketing Solutions (GMS) sales support team is responsible for helping deliver customer success. The team collaborates with Account Managers in the in-market GMS Sales teams, to co-design and manage implementation of Google solutions that deliver high-quality results. This team supports advertisers around the world, with teams in Dublin and Hyderabad.As a Digital Marketing Strategist, you will handle advertisers within the Dutch small and medium-sized business market, and you will work in a pod with in-market Account Managers. Within this pod you will help clients meet their business goals via comprehensive solution design, effective campaign implementation, and corresponding performance optimization. You will develop deep expertise to design solutions ranging across all of search, display, mobile and video implementation, and will be measured on key metrics aligned to the Sales team’s targets.When our millions of advertisers and publishers are happy, so are we! Our Google Marketing Solutions (GMS) team of entrepreneurial, enthusiastic and client-focused members are the \"human face\" of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.", "title": "Digital Marketing Strategist, Customer Success Acceleration (Dutch)", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Dublin, Ireland"}, {"description-section": " Responsibilities   Develop a deep understanding of our strategic products (Mobile, Brand, Conversion Tracking, Shopping) and the scenarios in which they are a good fit for our clients. Know our internal tools and how they can be used in the team, account or campaign level to identify opportunities for our clients. Implement solutions, track performance and optimize against advertiser goals. Report on key performance indicators and value delivered for the team. Create proposals to represent solution design around client goals.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Ability to speak and write in English and Dutch fluently and idiomatically. Preferred qualifications: Client service/account management experience. Experience in data analysis and reporting. Ability to operate independently, and also collaborate as part of a tight-knit team. Ability to work in fast-paced environments with effective time-management skills. Excellent analytical and problem-solving skills. ", "description-section text with-benefits": " Nest is looking for talented software engineers to join the Algorithms team to develop new state of the art machine learning systems. At Nest, you’ll join a world class engineering team focused on defining the smart home of the future.You'll be responsible to architect, design and implement the intelligence which solves real world problems in everyday users’ lives.  The work:  Develop and test systems to analyze, train, deploy, and monitor new algorithms across a diverse set of input domains  Collaborate on early product designs to ensure intelligence is a central component of future Nest products  Collaborate within Google and 3rd party organizations on smart home research  Minimum qualifications:  MS in Electrical Engineering, Computer Science, Computer Engineering, Mathematics, or equivalent practical experience  3 years experience in at least one of: Python, C/C++, or Java  3 years experience in statistics, data analysis, or machine learning  Preferred qualifications:  Ph.D. or 5+ years of work in Computer Science, Electrical Engineering or a related field  First-hand experience with a variety of machine learning and control techniques  Knowledge of embedded or cloud-based algorithm development  Knowledge of digital signal processing or image processing  Strong data analysis skills  Organized, detail-oriented and pragmatic  Thrives on collaboration in a multi-disciplinary team ", "title": "Algorithm Engineer", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Palo Alto, CA, United States"}, {"description-section": " Responsibilities   Work with the team to identify and qualify business opportunities and identify key customer technical objections. Develop the strategy to resolve technical impediments. Be responsible for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources. Work with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents. Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers to optimize Google Cloud Platform effectiveness.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or equivalent practical experience. Experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer-facing role (including working as a member of a professional services or systems engineering team).  Preferred qualifications: Master's degree in Computer Science or related technical field. Experience with Big Data, PaaS, and IaaS technologies. Experience architecting and developing software or infrastructure for scalable, distributed systems. Experience in data and information management, especially as it relates to Big Data trends and issues within businesses. Experience using and/or managing databases. Understanding of Map Reduce, Hadoop, Spark, Flume, Hive, Impala, SparkSQL, BigQuery. Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT space. Effective presentation skills. ", "description-section text with-benefits": "The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners. As a Google Cloud Solutions Engineer, you assist fellow Sales Googlers by problem-solving key technical issues for our customers. You liaise with the Product Marketing Management and Engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.  Your previous experience with cloud platform and infrastructure products, search products, content/document management repository systems and SQL-based relational databases will be on display as you engage with customers to understand their business and technical requirements. You''ll have excellent presentation skills and the ability to persuasively present Google's product offering.  In this role, you'll work closely with the Sales team to introduce Google Cloud Platform to our customers. You will help prospective customers and partners to understand the power of Google Cloud Platform, explaining technical features and problem-solving key technical issues.Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.", "title": "Solutions Engineer, Google Cloud", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Singapore"}, {"description-section": " Responsibilities   Work with the team to identify and qualify business opportunities and identify key customer technical objections. Develop the strategy to resolve technical impediments. Be responsible for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources. Work with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents. Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers to optimize Google Cloud Platform effectiveness.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or equivalent practical experience. Experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer-facing role (including working as a member of a professional services or systems engineering team).  Preferred qualifications: Master's degree in Computer Science or related technical field. Experience with Big Data, PaaS, and IaaS technologies. Experience architecting and developing software or infrastructure for scalable, distributed systems. Experience in data and information management, especially as it relates to Big Data trends and issues within businesses. Experience using and/or managing databases. Understanding of Map Reduce, Hadoop, Spark, Flume, Hive, Impala, SparkSQL, BigQuery. Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT space. Effective presentation skills. ", "description-section text with-benefits": " Nest Labs is seeking a technical publications manager to empower Nest's partners and 3rd-party developers to be self-sufficient using our documentation. Responsible for managing all tasks related to technical documentation for Nest Labs, including both creating and maintaining all developer-facing and partner-facing documents. Ensure that all documentation is accurate, consistent, and meets the company’s needs and standards. Use your passion, insights, and technical skills to help us create effective content.  The work:  Oversees all technical documentation created by Nest Labs  Primary publisher for all partner-facing, developer-facing, and internal technical documents  Writes, edits, distributes for review, and updates existing, and new documents  Establishes and implements standardized documentation formats, working with Marketing on branding  Creates and maintains processes for all documentation creation and distribution  Distributes publications on multiple web platforms  Collaborates with Engineering, Products, Solutions, Support, Sales Engineering, and Marketing  Maintains and expands the external-facing Community KB (Knowledge Base) and FAQs based on support tickets and internally-identified issues  Minimum qualifications:  5+ years experience with technical documentation for an admin or developer audience, ideally in networking, energy, or IoT  Course study in Technical Writing, Interactive Learning, Instructional Design, or related field with a minimum of a Bachelor’s degree  Preferred qualifications:  Ability to independently organize and prioritize multiple projects  Excellent verbal and written communications skills  Ability to resolve issues while maintaining a good working relationship with internal and external stakeholders  Creative and willing to gain an appropriate level of understanding of subject matter  Able to take initiative, maintain a positive attitude, be self-motivated, and work effectively on projects with minimal direct supervision  Able to be flexible with work hours to coordinate with teams around the globe ", "title": "Manager, Technical Publications", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "Palo Alto, CA, United States"}, {"description-section": " Responsibilities   Work with the team to identify and qualify business opportunities and identify key customer technical objections. Develop the strategy to resolve technical impediments. Be responsible for technical aspects of solutions to include such activities as supporting bid responses, product and solution briefings, proof-of-concept work, and the coordination of supporting technical resources. Work with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques to include whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI response documents. Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing “best practice” advice to customers to optimize Google Cloud Platform effectiveness.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or equivalent practical experience. Experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer-facing role (including working as a member of a professional services or systems engineering team).  Preferred qualifications: Master's degree in Computer Science or related technical field. Experience with Big Data, PaaS, and IaaS technologies. Experience architecting and developing software or infrastructure for scalable, distributed systems. Experience in data and information management, especially as it relates to Big Data trends and issues within businesses. Experience using and/or managing databases. Understanding of Map Reduce, Hadoop, Spark, Flume, Hive, Impala, SparkSQL, BigQuery. Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT space. Effective presentation skills. ", "description-section text with-benefits": " Nest is seeking an experienced public relations professional to help build the profile of Nest’s award winning products. This is a great opportunity to work in a fast-paced environment on products that can make a positive difference in people’s lives. Experience in the technology industry, and a passion for great products is a must.  The work:  Play a major role in the research, planning and development of comprehensive public relations programs  Build and maintain strong relationships with members of the press, influencers, and key partners  Generate media outreach strategies, and execute plans thoughtfully and effectively  Create content for the Nest blog, write press releases, media pitches, and other types of content  Work cross-functionally with members of Nest’s product and engineering teams to create effective messaging to support new products and services  Minimum qualifications:  5 years of experience managing successful public relations programs  BA or BS degree  Existing relationships with key members of the press  Preferred qualifications:  Ability to effectively communicate information and ideas in written and verbal format  Adept at building and maintaining relationships  Team player, with the confidence to take the lead and execute with minimal guidance  Ability to partner with stakeholders in other departments  Strong project management and organizational skills  Experience working both in-house and at an agency a plus Social media experience a plus", "title": "Public Relations Manager", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "San Francisco, CA, United States"}, {"description-section": " Responsibilities   Develop strategy, concepts and tactics for our Success Online efforts across Denmark across channels. Managing relationships, building networks and ensuring that all initiatives are of consistent and high quality, and representative of the brand. Manage diverse initiatives to ensure reporting with relation to specific KPIs. Conduct ongoing outreach to local municipalities and partners to collaborate on our Growth Engine initiatives. Manage external and internal communication about the program. Work with internal stakeholders to produce Growth Engine initiatives, and work within agreed budgets to deliver end to end support for initiatives and events. Manage relationships with external agencies, production companies and vendors. Analyze programs for effectiveness; conduct post-event reporting and ROI analysis.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. Technology/online industry experience. Ability to speak and write in English and Danish fluently and idiomatically. Preferred qualifications: Experience working with non-hierarchical, cross-functional matrix teams, across numerous geographies. Event management and online marketing experience. Experience delivering multiple projects at one time in a fast-moving environment. Knowledge of online products, online marketing and an understanding of Google’s strategic position within the market. Demonstrated analytical skills and ability to develop marketing strategy, business plans and market insights. Demonstrated event execution skills and written/verbal communication skills. ", "description-section text with-benefits": "Whether you're on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (AdWords, AdSense, DoubleClick, Analytics), you take part in a complete marketing experience as you lead every facet of the product's journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you'll be involved with product marketing strategy from beginning to end. You are a flexible, hardworking marketer with demonstrable interest and understanding for Google. One of the main priorities of the role is to be in charge of positioning, packaging, and promoting Google's Growth Engine initiative, Success Online. You will engage with several public and private partners with the aim to train people in digital skills. Success Online targets small businesses, students/job seekers and on-the job trainers. The program is a truly cross functional effort between marketing, PR and Policy.  You will also work closely with external stakeholders, such as program partners, city officials and agencies. The role involves some business travel especially within the Nordics. You will consistently work on improving all existing initiatives and be ready and willing to devise and pilot new, innovative ideas. Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google's products solve the world's problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.", "title": "Product Marketing Manager (PMM), Growth Engine", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Mumbai, Maharashtra, India; Bengaluru, Karnataka, India; Gurugram, Haryana, India", "location": "København, Denmark"}, {"description-section": " Responsibilities   Become an expert in Shopping for Google products and the ecosystem. Feed and campaign best practices, provided product roadmaps and provide expertise on third-party platforms. Manage Shopping business growth. Lead, drive and scale product launches (e.g. LIA, Showcase, POG, etc). Provide quarterly priority activations as set by Shopping sales leadership. Continuously educate customers and clients with products and best-practices.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 4 years of experience working in digital marketing/sales. Preferred qualifications: Understanding of industry metrics and KPIs, and features and benefits of Google Shopping products. Ability to provide thought leadership and effectively lead discussions at C-Level/Director Level. Ability to deliver insights/out of sights from data that creates business value and drive client action. Proficiency using shopping related tools and resources to manage Shopping activation. Effective communication, business planning, consulting skills and sales driven motivation. ", "description-section text with-benefits": "Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google's key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users. As a Sales Specialist, you will manage Shopping account business growth by partnering with the pods and collaborating directly with clients to provide strategy, guidance, consultation, and support for Shopping campaigns, presentations and sales activation.Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We're uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google's broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.", "title": "Sales Specialist, Shopping", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA", "location": "New York, NY, United States"}, {"description-section": " Responsibilities   Become an expert in Shopping for Google products and the ecosystem. Feed and campaign best practices, provided product roadmaps and provide expertise on third-party platforms. Manage Shopping business growth. Lead, drive and scale product launches (e.g. LIA, Showcase, POG, etc). Provide quarterly priority activations as set by Shopping sales leadership. Continuously educate customers and clients with products and best-practices.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 4 years of experience working in digital marketing/sales. Preferred qualifications: Understanding of industry metrics and KPIs, and features and benefits of Google Shopping products. Ability to provide thought leadership and effectively lead discussions at C-Level/Director Level. Ability to deliver insights/out of sights from data that creates business value and drive client action. Proficiency using shopping related tools and resources to manage Shopping activation. Effective communication, business planning, consulting skills and sales driven motivation. ", "description-section text with-benefits": " Are you passionate about applying technologies that make an impact? At Nest you'll have the opportunity to shape the consumer electronics business, join a world class engineering team, and help revolutionize the next unloved device in our homes.  Nest’s Product Integration Engineering team is looking for a hands-on technical leader for our Product Integration Engineering team. The Product Integration Engineering (IE) team focus is on delivering robust customer-facing products and feature experience with best in class development practices.  The work:  Drive a team of engineers to qualify the integration of embedded software solutions onto development/production hardware architecture  Manage the development of a diverse and highly functional engineering team  Develop a scalable end-to-end test automation strategy across products, including sustainable physical and virtual infrastructure  Provide technical solutions to complex product development problems  Maintain a “data-driven” approach to critical product and technical platform decision s  Drive and support organization deliverables, including time to market and quality of product  Implement and define measurable approach to strategy and goal achievement  Provide guidance to platform stakeholders and leadership based on deep subject matter expertise  Set the initiatives for the engineering staff, and actively support the goals and objectives of the organization as a whole  Build and maintain strong cross-functional relationships platform and organization wide  Minimum qualifications:  Bachelor’s degree in Computer Science/Engineering or equivalent practical experience  5+ years of technical leadership experience  3+ years experience with a programming or scripting language (i.e. Python, C, C++)  2+ years experience with the Linux operating system and development platform  Able to thrive in a team oriented, fast paced work environment  Adept at effectively solving technical challenges in a complex environment  Excellent people and vendor management experience  Consumer electronic release and deployment experience  Preferred qualifications:  Master’s degree in Computer Science/Engineering or equivalent practical experience  Passion for quality, efficiency, productivity, and infrastructure  Experience with high quality distributed systems  Experience with wireless communication protocols such as WiFi and Bluetooth  Experience with sensors and supporting algorithms  Experience with full software development release cycle  Effective communication skills to thrive in highly collaborative work environment ", "title": "Manager - Nest Integration Engineering", "company": " Nest ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA", "location": "Palo Alto, CA, United States"}, {"description-section": " Responsibilities   Monitor network performance and lead troubleshooting efforts for entire network systems (end-to-end long haul route, complete metro transport, core routing elements). Coordinate outside plant moves/changes. Prepare and implement MOPs and update network documentation based on changes in network topology Manage local technical operations staff and Vendor performance for both inside and outside plant. Develop and document field operations standards, training, and best practices. Collaborate with central, regional, and local teams to identify and develop scalable network designs, innovations and policy recommendations to improve the network and its deployment. Program manage Operations schedule, costs, and performance. Lead new Plant testing and acceptance to ensure everything is ready to give our customers the best experience possible on their new Google Fiber service. Lead metro implementation of Last Mile and Customer Installation efforts to ensure rapid deployment of Google Fiber.   Qualifications  Minimum qualifications: Bachelor's degree or equivalent practical experience. 5 years of experience in a Network Operations, Engineering, Construction and/or Maintenance role. Experience managing telecommunication infrastructure, Fiber to the Home/Plant (FTTx) operations and/or outside plant (OSP) projects. Preferred qualifications: PMP or MBA with practical experience in telecommunications industry. Experience in managing complex, cross functional projects. Demonstrate ability to grow and mature network systems and operations. ", "description-section text with-benefits": "The Operations Manager will ensure that network operations are reliable and efficient by monitoring network performance, performing planned maintenance, proactively identifying and repairing network difficulties, and responding to network connectivity issues. Google's complex network generates a constant stream of challenges which requires the Operations Manager to continually be innovative with an evolving set of technologies and processes. The Operations Manager will lead testing, acceptance, last mile and installation operations to bring Google Fiber to customers as quickly as possible. Additionally, the Operations Manager will perform critical tasks that maintain and improve network operations and will take the technical lead in ensuring a reliable and efficiently operating network. At Access, our mission is to create abundant internet on networks that are always fast and always open. Google Fiber provides superfast Internet to homes in 9 metro areas across the U.S. We want to bring Google Fiber to customers even faster, so we’re focused on making deployment more efficient and less intrusive.", "title": "Operations Manager, Google Fiber", "company": " Google Fiber ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA", "location": "Louisville, KY, United States"}, {"description-section": " Responsibilities   Inspire, grow, and develop talent, while providing vision and setting direction for the team. Lead effectively through outcomes rather than tasks. Collaborate with partner teams to achieve shared objectives, to provide strategic insight, and to lead continuous improvement efforts in customer service and operations. Drive results by tracking key operational metrics, identifying process improvement opportunities and delivering on strategic initiatives. Oversee the design and operation of various cloud-based services, systems and applications. Lead hiring and career development for a team of intelligent, ambitious professionals across a variety of technical disciplines.   Qualifications  Minimum qualifications: Bachelor's degree in Computer Science, or a related technical field, or equivalent practical experience. 5 years of technical experience as an individual contributor prior to management. Experience with Linux, OS X, Windows, networking, mobile, video conferencing and/or voice technologies. Preferred qualifications: 5 years of experience in managing a team of engineering and/or technical operations professionals responsible for critical systems and operations for a distributed organization. 5 years of experience in building and developing teams. Experience in hiring and developing suitably talented and motivated people. Experience in leading people through change while maintaining the ability to adjust to rapidly changing technology and to make decisions with limited information. Ability to prioritize and manage across multiple, often time-sensitive initiatives. Exceptional organizational, communication, leadership and customer service skills. ", "description-section text with-benefits": "Technical support for a technology company is a big task. As the Operations Manager within the IT Support Technician team, your mission is to enable the people and technology that keep Google running. Your team provides the front line user support for all of our internal tools and technologies. Beyond the day-to-day, the team will contribute to longer-term technical projects, process improvement and the documentation efforts that help make the Google magic happen. As a Technical Operations Manager, you'll be an inspirational leader with experience in recruiting, developing and guiding a talented team of engineering and operations professionals. You'll also bring a passion for pushing the limits of technology, while also using that passion to encourage users, both large and small, to adopt cloud-based computing and mobile technologies. Additionally, you'll have a technical foundation and the flexibility, talent and aptitude to learn new technologies and to lead a variety of projects and teams across the organization.Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology's greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From AdWords to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.", "title": "Technical Operations Manager, Corporate Engineering", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA", "location": "Xinyi District, Taiwan"}, {"description-section": " Responsibilities   Become a credible and authentic technology leader, deliver the team's vision and technology to prospects, partners and customers in the region. Align the technical requirements and the solution design with the customer's business drivers and demonstrate our unique value. Hire, coach and drive a team to work towards assigned goals. Partner with the customer to develop a strong working relationship with the customer’s technical staff and be able to gain their trust and credibility through your deep technical knowledge and domain expertise. This, while working closely with geographically distributed Apigee and Customer project teams. Travel up to 50% of the time as required.   Qualifications  Minimum qualifications: BA/BS degree in Computer Science or a related technical field or equivalent practical experience. Experience in people management, coaching and growing a team of Technical Consultants. Preferred qualifications: Experience providing organizational and subject matter leadership on technical sales strategies. Ability to work across Product Marketing, Product Management, Engineering, Customer Success and Sales Management functions. Development experience using Google or other cloud products. Understanding of private, public and hybrid cloud design considerations and limitations in the areas of virtualization and global infrastructure, distributed systems, load balancing and networking and security. Ability to facilitate the development and communication of robust solutions to technical and business audiences. Excellent listening, critical thinking and analytical skills. ", "description-section text with-benefits": "Apigee Edge is an advanced API platform that enables enterprises to create, manage, secure and scale APIs. Using Apigee, enterprises can design and deploy API proxies in public and private clouds, secure data in transit with OAuth 2.0, SAML and two-way TLS, protect against traffic spikes by adding dynamic routing, caching and rate-limiting policies to APIs, and measure the success of both API operations and API business with end-to-end analytics.As part of an entrepreneurial team in this rapidly growing business, you will help businesses of all sizes leverage technology to connect with customers, employees and partners. As a Solutions Architect Manager, you will coach a team of Solution Architects who engage with prospects and customers on their journey with Apigee. We're building a team that understands and can assess a customer's requirements, prepare and present demonstrations of the Apigee platform and help customers build robust production ready solutions. You'll also directly engage with customers on a regular basis independent of your team to drive customer success.Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.", "title": "Manager, Solutions Architecture, Google Cloud (Apigee)", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: Paris, France; Berlin, Germany; Munich, Germany", "location": "Berlin, Germany"}, {"description-section": " Responsibilities   Act as an expert for Google’s advertiser products working with internal stakeholders and clients to realize business goals in the market and to identify new business opportunities. Engage with cross-functional partners globally to manage projects, resolve issues and drive business and operations forward. Prioritize and deliver outstanding customer service through your own efforts and through working with vendors and internal partners to drive internal operations to meet efficiency, speed and CSAT goals. Understand requirements and communicate complex information and solutions relating to applying ad products and technologies. Lead and motivate others around you, being mindful of global inclusivity.   Qualifications  Minimum qualifications: BA/BS degree or equivalent practical experience. 4 years of work experience in operations, customer experience or consulting in a relevant industry. Experience managing multiple global projects simultaneously. Preferred qualifications: MBA or MS degree. 4 years of experience in digital ad operations or experience in the online advertising industry. Experience with the ad serving industry and internet technologies. Experience with SQL databases and dashboard creation or experience with one object-oriented programming language (e.g., Java, Python, etc.). Experience working with vendors and global teams. Proven communication, creative problem-solving and strong analytical skills on complex topics. ", "description-section text with-benefits": "Google Technical Services: Professional Services (gPS) is a team of solution-oriented trusted advisors supporting millions of users worldwide. Our consultative services take our deep technical and product expertise and combine it with our powerful understanding of our customer’s needs and goals to solve their biggest business challenges allowing them to grow and get the most out of Google solutions. Behind every advertising campaign at Google are systems to make it run. Behind those systems are Googlers who advise and partner with our users and customers. As an Advertiser Solutions Consultant you will support vendors, sales, and our customers with your AdWords implementation and scaled operations expertise. Your stakeholders will look to your expertise on product configuration and business processes, combining your deep understanding of Google Ads products with industry best practices and operations.Google Technical Services is a global support and operations team, with a mission to delight our customers with care so good, it’s got to be Google. Our team is the face of Google to most of our customers, and we want their Google support experience to set new standards, just like Google’s products do. Our team cares for customers by solving problems and scaling solutions, incubating new Google products, and sharing user feedback with internal teams to influence product development. We support a wide variety of products, from Ads to Project Fi and just about everything in between, and our customers include advertisers, consumers, partners, publishers, retailers, and our own Sales Googlers.", "title": "AdWords Campaign Solution Specialist, Google Professional Services", "company": " Google ", "description-section text": "Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Boulder, CO, USA", "location": "New York, NY, United States"}]